<!DOCTYPE html>
<html>
<body>
<div align="center">
<h3>Prepared by Asif Bhat</h3>
    
<h1>Pandas - Series & Dataframes</h1>

<h3>Follow Me on - <a href="https://www.linkedin.com/in/asif-bhat/">LinkedIn</a>&nbsp; <a href="https://mobile.twitter.com/_asifbhat_">Twitter</a>&nbsp; <a href="https://www.instagram.com/datasciencescoop/?hl=en">Instagram</a>&nbsp; <a href="https://www.facebook.com/datasciencescoop/">Facebook</a></h3>
</div>
</body>
</html>

In [13]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import glob
import re
import math

In [14]:
!pip install numpy

Requirement already satisfied: numpy in /Users/Optimus/opt/anaconda3/envs/env1/lib/python3.7/site-packages (1.18.2)

# Merge Dataframes

In [15]:
daf1 =  pd.DataFrame ({'id': ['1', '2', '3', '4', '5'], 'Name': ['Asif', 'Basit', 'Bran', 'John', 'David']})
daf1

  id   Name
0  1   Asif
1  2  Basit
2  3   Bran
3  4   John
4  5  David

In [16]:
daf2 =  pd.DataFrame ({'id': ['1', '2', '6', '7', '8'], 'Score': [40 , 60 , 80 , 90 , 70]})
daf2

  id  Score
0  1     40
1  2     60
2  6     80
3  7     90
4  8     70

In [5]:
# Inner Join
pd.merge(daf1, daf2, on='id', how='inner')

  id   Name  Score
0  1   Asif     40
1  2  Basit     60

In [17]:
# Full Outer Join
pd.merge(daf1, daf2, on='id', how='outer')

  id   Name  Score
0  1   Asif   40.0
1  2  Basit   60.0
2  3   Bran    NaN
3  4   John    NaN
4  5  David    NaN
5  6    NaN   80.0
6  7    NaN   90.0
7  8    NaN   70.0

In [7]:
# Left Outer Join
pd.merge(daf1, daf2, on='id', how='left')

  id   Name  Score
0  1   Asif   40.0
1  2  Basit   60.0
2  3   Bran    NaN
3  4   John    NaN
4  5  David    NaN

In [8]:
#Right Outer Join
pd.merge(daf1, daf2, on='id', how='right')

  id   Name  Score
0  1   Asif     40
1  2  Basit     60
2  6    NaN     80
3  7    NaN     90
4  8    NaN     70

# Importing multiple CSV files in DataFrame
> https://github.com/CSSEGISandData/COVID-19/tree/master/csse_covid_19_data/csse_covid_19_daily_reports

In [21]:
import pandas as pd

In [25]:
df = pd.read_csv('../../sample_covid19.csv') # for each root folder lever to reach we add "../""

In [26]:
df

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key
0,45001.0,Abbeville,South Carolina,US,2020-05-17 02:32:32,34.223334,-82.461707,34,0,0,34,"Abbeville, South Carolina, US"
1,22001.0,Acadia,Louisiana,US,2020-05-17 02:32:32,30.295065,-92.414197,192,11,0,181,"Acadia, Louisiana, US"
2,51001.0,Accomack,Virginia,US,2020-05-17 02:32:32,37.767072,-75.632346,668,9,0,659,"Accomack, Virginia, US"
3,16001.0,Ada,Idaho,US,2020-05-17 02:32:32,43.452658,-116.241552,773,22,0,751,"Ada, Idaho, US"
4,19001.0,Adair,Iowa,US,2020-05-17 02:32:32,41.330756,-94.471059,4,0,0,4,"Adair, Iowa, US"
...,...,...,...,...,...,...,...,...,...,...,...,...
3299,NaN,NaN,NaN,West Bank and Gaza,2020-05-17 02:32:32,31.952200,35.233200,376,2,329,45,West Bank and Gaza
3300,NaN,NaN,NaN,Western Sahara,2020-05-17 02:32:32,24.215500,-12.885800,6,0,6,0,Western Sahara
3301,NaN,NaN,NaN,Yemen,2020-05-17 02:32:32,15.552727,48.516388,122,18,1,103,Yemen
3302,NaN,NaN,NaN,Zambia,2020-05-17 02:32:32,-13.133897,27.849332,679,7,183,489,Zambia
3303,NaN,NaN,NaN,Zimbabwe,2020-05-17 02:32:32,-19.015438,29.154857,42,4,13,25,Zimbabwe

In [27]:
# Append all CSV files 
path =r'/Users/Optimus/Documents/GitHub/AdalegIT'
filenames = glob.glob(path + "/*.csv")
covid = pd.DataFrame()
for f in filenames:
    df = pd.read_csv(f)
    covid = covid.append(df,ignore_index=True,sort=True)

In [29]:
# Top 10 rows of the Dataframe
covid.head(5)

,Active,Admin2,Combined_Key,Confirmed,Country_Region,Deaths,FIPS,Last_Update,Lat,Long_,Province_State,Recovered
0,34,Abbeville,"Abbeville, South Carolina, US",34,US,0,45001.0,2020-05-17 02:32:32,34.223334,-82.461707,South Carolina,0
1,181,Acadia,"Acadia, Louisiana, US",192,US,11,22001.0,2020-05-17 02:32:32,30.295065,-92.414197,Louisiana,0
2,659,Accomack,"Accomack, Virginia, US",668,US,9,51001.0,2020-05-17 02:32:32,37.767072,-75.632346,Virginia,0
3,751,Ada,"Ada, Idaho, US",773,US,22,16001.0,2020-05-17 02:32:32,43.452658,-116.241552,Idaho,0
4,4,Adair,"Adair, Iowa, US",4,US,0,19001.0,2020-05-17 02:32:32,41.330756,-94.471059,Iowa,0

In [33]:
# Bottom 10 rows of the Dataframe
covid.tail(5)
covid.sample(10)
covid.shape

(3304, 12)

In [65]:
# Reading columns
covid['Country_Region'].head(10).value_counts()
df1

              Last_Update      Country_Region  Province_State  Confirmed
0     2020-05-17 02:32:32                  US  South Carolina         34
1     2020-05-17 02:32:32                  US       Louisiana        192
2     2020-05-17 02:32:32                  US        Virginia        668
3     2020-05-17 02:32:32                  US           Idaho        773
4     2020-05-17 02:32:32                  US            Iowa          4
...                   ...                 ...             ...        ...
3299  2020-05-17 02:32:32  West Bank and Gaza             NaN        376
3300  2020-05-17 02:32:32      Western Sahara             NaN          6
3301  2020-05-17 02:32:32               Yemen             NaN        122
3302  2020-05-17 02:32:32              Zambia             NaN        679
3303  2020-05-17 02:32:32            Zimbabwe             NaN         42

[3304 rows x 4 columns]

In [67]:
# Reading columns
df1 = covid[['Last_Update', 'Country_Region' ,'Province_State','Confirmed']]
df1.head(10)
# df1.iloc
df1.iloc[[0,-1],[1,2]]
df1.iloc[[1,2,3],[1,2]]
df1.iloc[ , ]

  Country_Region Province_State
1             US      Louisiana
2             US       Virginia
3             US          Idaho

In [ ]:
#Read specific rows 
df1.iloc[1:4]

In [61]:
#Filter data 
df1.loc[df1['Country_Region']== 'India']

              Last_Update Country_Region Province_State  Confirmed
3198  2020-05-17 02:32:32          India            NaN      90648

In [71]:
#Sort Data Frame
display('Sorted Data Frame', df1.sort_values(['Country_Region'], ascending=True).head(5))

'Sorted Data Frame'

              Last_Update Country_Region Province_State  Confirmed
3123  2020-05-17 02:32:32    Afghanistan            NaN       6402
3124  2020-05-17 02:32:32        Albania            NaN        933
3125  2020-05-17 02:32:32        Algeria            NaN       6821
3126  2020-05-17 02:32:32        Andorra            NaN        761
3127  2020-05-17 02:32:32         Angola            NaN         48

In [73]:
#Sort Data Frame
display('Sorted Data Frame', df1.sort_values(['Country_Region'], ascending=False).head(5))

'Sorted Data Frame'

              Last_Update      Country_Region Province_State  Confirmed
3303  2020-05-17 02:32:32            Zimbabwe            NaN         42
3302  2020-05-17 02:32:32              Zambia            NaN        679
3301  2020-05-17 02:32:32               Yemen            NaN        122
3300  2020-05-17 02:32:32      Western Sahara            NaN          6
3299  2020-05-17 02:32:32  West Bank and Gaza            NaN        376

In [97]:
#Sort Data Frame - Ascending on "Country" & descending on "Last update"
display('Sorted Data Frame', df1.sort_values(['Country_Region', 'Last_Update'], ascending=[1,0]).head(5))

'Sorted Data Frame'

              Last_Update Country_Region Province_State  Confirmed
3123  2020-05-17 02:32:32    Afghanistan            NaN       6402
3124  2020-05-17 02:32:32        Albania            NaN        933
3125  2020-05-17 02:32:32        Algeria            NaN       6821
3126  2020-05-17 02:32:32        Andorra            NaN        761
3127  2020-05-17 02:32:32         Angola            NaN         48

In [98]:
display('Sorted Data Frame', df1.sort_values(['Country_Region', 'Province_State'], ascending=[1,1])[df1['Country_Region']=='US'])

/Users/Optimus/opt/anaconda3/envs/env1/lib/python3.7/site-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

'Sorted Data Frame'

              Last_Update Country_Region Province_State  Confirmed
104   2020-05-17 02:32:32             US        Alabama        110
112   2020-05-17 02:32:32             US        Alabama        254
123   2020-05-17 02:32:32             US        Alabama         79
187   2020-05-17 02:32:32             US        Alabama         50
204   2020-05-17 02:32:32             US        Alabama         45
...                   ...            ...            ...        ...
2555  2020-05-17 02:32:32             US        Wyoming         23
2588  2020-05-17 02:32:32             US        Wyoming        100
2648  2020-05-17 02:32:32             US        Wyoming         10
2700  2020-05-17 02:32:32             US        Wyoming          0
2794  2020-05-17 02:32:32             US        Wyoming          9

[2985 rows x 4 columns]

In [99]:
#Iterating through the dataset
for index , row in df1.iterrows():
    if (row['Country_Region'] == 'Indonesia' ):
        display(row[['Country_Region' ,'Confirmed']])

Country_Region    Indonesia
Confirmed             17025
Name: 3199, dtype: object

In [101]:
#Unique Values
covid['Country_Region'].drop_duplicates(keep='first').head(10)

0                   US
2978             Italy
2979            Canada
2980             Spain
2981    United Kingdom
2982             China
2984       Netherlands
2986         Australia
2987           Germany
3017           Denmark
Name: Country_Region, dtype: object

In [104]:
# Countries impacted with Coronavirus
countries = covid['Country_Region'].unique()
type(countries) , countries

(numpy.ndarray,
 array(['US', 'Italy', 'Canada', 'Spain', 'United Kingdom', 'China',
        'Netherlands', 'Australia', 'Germany', 'Denmark', 'France',
        'Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola',
        'Antigua and Barbuda', 'Argentina', 'Armenia', 'Austria',
        'Azerbaijan', 'Bahamas', 'Bahrain', 'Bangladesh', 'Barbados',
        'Belarus', 'Belgium', 'Belize', 'Benin', 'Bhutan', 'Bolivia',
        'Bosnia and Herzegovina', 'Botswana', 'Brazil', 'Brunei',
        'Bulgaria', 'Burkina Faso', 'Burma', 'Burundi', 'Cabo Verde',
        'Cambodia', 'Cameroon', 'Central African Republic', 'Chad',
        'Chile', 'Colombia', 'Comoros', 'Congo (Brazzaville)',
        'Congo (Kinshasa)', 'Costa Rica', "Cote d'Ivoire", 'Croatia',
        'Cuba', 'Cyprus', 'Czechia', 'Diamond Princess', 'Djibouti',
        'Dominica', 'Dominican Republic', 'Ecuador', 'Egypt',
        'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Estonia',
        'Eswatini', 'Ethiopia', 'Fiji', 'Finland', 'Gabon', 'Gambia',
        'Georgia', 'Ghana', 'Greece', 'Grenada', 'Guatemala', 'Guinea',
        'Guinea-Bissau', 'Guyana', 'Haiti', 'Holy See', 'Honduras',
        'Hungary', 'Iceland', 'India', 'Indonesia', 'Iran', 'Iraq',
        'Ireland', 'Israel', 'Jamaica', 'Japan', 'Jordan', 'Kazakhstan',
        'Kenya', 'Korea, South', 'Kosovo', 'Kuwait', 'Kyrgyzstan', 'Laos',
        'Latvia', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
        'Liechtenstein', 'Lithuania', 'Luxembourg', 'MS Zaandam',
        'Madagascar', 'Malawi', 'Malaysia', 'Maldives', 'Mali', 'Malta',
        'Mauritania', 'Mauritius', 'Mexico', 'Moldova', 'Monaco',
        'Mongolia', 'Montenegro', 'Morocco', 'Mozambique', 'Namibia',
        'Nepal', 'New Zealand', 'Nicaragua', 'Niger', 'Nigeria',
        'North Macedonia', 'Norway', 'Oman', 'Pakistan', 'Panama',
        'Papua New Guinea', 'Paraguay', 'Peru', 'Philippines', 'Poland',
        'Portugal', 'Qatar', 'Romania', 'Russia', 'Rwanda',
        'Saint Kitts and Nevis', 'Saint Lucia',
        'Saint Vincent and the Grenadines', 'San Marino',
        'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
        'Seychelles', 'Sierra Leone', 'Singapore', 'Slovakia', 'Slovenia',
        'Somalia', 'South Africa', 'South Sudan', 'Sri Lanka', 'Sudan',
        'Suriname', 'Sweden', 'Switzerland', 'Syria', 'Taiwan*',
        'Tajikistan', 'Tanzania', 'Thailand', 'Timor-Leste', 'Togo',
        'Trinidad and Tobago', 'Tunisia', 'Turkey', 'Uganda', 'Ukraine',
        'United Arab Emirates', 'Uruguay', 'Uzbekistan', 'Venezuela',
        'Vietnam', 'West Bank and Gaza', 'Western Sahara', 'Yemen',
        'Zambia', 'Zimbabwe'], dtype=object))

In [ ]:
df2 = pd.read_csv('Pokemon.csv')
df2.head(5)

In [ ]:
# Sum of Columns 
df2['Total'] = df2['HP'] + df2['Attack']
df2.head(5)

In [ ]:
# Sum of Columns 
df2['Total'] = df2.iloc[:,4:10].sum(axis=1)
df2.head(5)

In [ ]:
#Shifting "Total" column

cols = list(df2.columns)

df2 = df2[cols[0:10] + [cols[-1]] + cols[10:12]]
df2.head(5)

In [ ]:
#Shifting "Legendary" column -  Index location -1 or 12

cols = list(df2.columns)

df2 = df2[cols[0:10] + [cols[-1]] + cols[10:12]]
df2.head(5)

In [ ]:
#Shifting "Generation" column - Index location -1 or 12

cols = list(df2.columns)

df2 = df2[cols[0:10] + [cols[12]] + cols[10:12]]
df2.head(5)

In [ ]:
#Save to CSV file

df2.to_csv('poke_updated.csv')

In [ ]:
#Save to CSV file without index column

df2.to_csv('poke_updated1.csv', index=False)

In [ ]:
df2.head(10)

In [ ]:
# Save Dataframe as text file
df2.to_csv('poke.txt' , sep='\t' , index=False)

In [ ]:
# Save Dataframe as xlsx file
df2.to_excel('poke.xlsx')

In [ ]:
# Save Dataframe as xlsx file without row names
df2.to_excel('poke.xlsx', index=0)

In [ ]:
#Filtering using loc

df2.loc[df2['Type 2'] == 'Dragon']

In [ ]:
#Filtering using loc
df3 = df2.loc[(df2['Type 2'] == 'Dragon') & (df2['Type 1'] == 'Dark')]
df3

In [ ]:
#Reset index for Dataframe df3 keeping old index column

df4 = df3.reset_index()
df4

In [ ]:
#Reset index for Dataframe df3 removing old index column

df3.reset_index(drop=True , inplace=True)
df3

In [ ]:
df2.head(10)

# LIKE OPERATION IN PANDAS

In [ ]:
df2.Name.str.contains("rill").head(10)

In [ ]:
# Display all rows containing Name "rill"
df2.loc[df2.Name.str.contains("rill")]

In [ ]:
# Exclude all rows containing "rill"
df2.loc[~df2.Name.str.contains("rill")].head(10)

In [ ]:
#Display all rows with Type-1 as "Grass" and Type-2 as "Poison"

df2.loc[df2['Type 1'].str.contains("Grass") & df2['Type 2'].str.contains("Poison")]

In [ ]:
df2.loc[df2['Type 1'].str.contains('Grass|Water',regex = True)].head(10)

In [ ]:
# Due to Case-sensitive it will not return any data

df2.loc[df2['Type 1'].str.contains('grass|water',regex = True)].head(10)

In [ ]:
# To ignore case we can use "case = False"

df2.loc[df2['Type 1'].str.contains('grass|water', case = False ,regex = True)].head(10)

In [ ]:
# To ignore case we can use "Flags = re.I"

df2.loc[df2['Type 1'].str.contains('grass|water',flags = re.I ,regex = True)].head(10)

# Regex in Pandas dataframe

In [ ]:
#Get all rows with name starting with "wa"

df2.loc[df2.Name.str.contains('^Wa',flags = re.I ,regex = True)].head(10)

In [ ]:
#Get all rows with name starting with "wa" followed by any letter between a-l

df2.loc[df2.Name.str.contains('^Wa[a-l]+',flags = re.I ,regex = True)].head(10)

In [ ]:
#Get all rows with name starting with x , y, z

df2.loc[df2.Name.str.contains('^[x-z]',flags = re.I ,regex = True)]

In [ ]:
# Extracting first 3 characters from "Name" column
df2['Name2'] = df2.Name.str.extract(r'(^\w{3})')

In [ ]:
df2.head(5)

In [ ]:
# Return all rows with "Name" starting with character 'B or b' 
df2.loc[df2.Name.str.match(r'(^[B|b].*)')].head(5)

# Replace values in dataframe

In [ ]:
df2.head(10)

In [ ]:
df2['Type 1'] = df2['Type 1'].replace({"Grass" : "Meadow" , "Fire" :"Blaze"})

In [ ]:
df2.head(10)

In [ ]:
df2['Type 2'] = df2['Type 2'].replace({"Poison" : "Venom"})

In [ ]:
df2.head(5)

In [ ]:
df2['Type 2'] = df2['Type 2'].replace(['Venom' , 'Dragon'] , 'DANGER')

In [ ]:
df2.head(10)

In [ ]:
df2.loc[df2['Type 2'] == 'DANGER' , 'Name2'] = np.NaN

In [ ]:
df2.head(10)

In [ ]:
df2.loc[df2['Total'] > 400 , ['Name2' , 'Legendary']] = 'ALERT'
df2.head(10)

In [ ]:
df2.loc[df2['Total'] > 400 , ['Legendary' , 'Name2']] = ['ALERT-1' , 'ALERT-2'] 
df2.head(10)

# Group By

In [ ]:
df = pd.read_csv('poke_updated1.csv')
df.head(5)

In [ ]:
df.groupby(['Type 1']).mean().head(10)

In [ ]:
df.groupby(['Type 1']).mean().sort_values('Attack' , ascending = False).head(10)

In [ ]:
df.groupby(['Type 1']).mean().sort_values('Defense' , ascending = False).head(10)

In [ ]:
df.groupby(['Type 1']).mean().sort_values('Speed' , ascending = False).head(10)

In [ ]:
df.sum()

In [ ]:
df.groupby(['Type 2']).sum().head(5)

In [ ]:
df.count()

In [ ]:
df['count1'] = 0
df.groupby(['Type 2']).count()['count1']

In [ ]:
df['count1'] = 0
df.groupby(['Type 1']).count()['count1']

In [ ]:
df['count1'] = 0
df.groupby(['Type 1' , 'Type 2' , 'Legendary']).count()['count1']

# Loading Data in Chunks

In [ ]:
for df in pd.read_csv('poke_updated1.csv', chunksize=10):
    print(df)

In [ ]:
df

In [ ]:
df1 = pd.DataFrame()
for df in pd.read_csv('poke_updated1.csv', chunksize=10):
    df1 = pd.concat([df1 ,df])
df1.head(15)

# Stack & unstack in Pandas

In [ ]:
col = pd.MultiIndex.from_product([['2010','2015'],['Literacy' , 'GDP']])

data =([[80,7,88,6],[90,8,92,7],[89,7,91,8],[87,6,93,8]])

df6 = pd.DataFrame(data, index=['India','USA' , 'Russia' , 'China'], columns=col)
df6

In [ ]:
# Stack() Function stacks the columns to rows.
st_df = df6.stack()
st_df

In [ ]:
#Unstacks the row to columns
unst_df = st_df.unstack()
unst_df

In [ ]:
unst_df = unst_df.unstack()
unst_df

In [ ]:
unst_df = unst_df.unstack()
unst_df

# PIVOT Tables

In [ ]:
data = {
    'Country':['India','USA' , 'Russia' , 'China','India','USA' , 'Russia' , 'China','India','USA' , 'Russia' , 'China','India','USA' , 'Russia' , 'China'],
    'Year':['2010','2010','2010','2010' , '2010','2010','2010','2010','2015','2015','2015','2015','2015','2015','2015','2015'],
     
    'Literacy/GDP':['GDP' , 'GDP' , 'GDP' , 'GDP','Literacy' , 'Literacy', 'Literacy' , 'Literacy','GDP' , 'GDP','GDP' , 'GDP','Literacy' , 'Literacy','Literacy' , 'Literacy'],
   'Value':[7,8,7,6,80,90,89,87,6,7,8, 8, 88 , 92 , 91 ,93]}
 
df7 = pd.DataFrame(data,columns=['Country','Year','Literacy/GDP','Value'])
df7

In [ ]:
# Pivot table with SUM aggregation
pd.pivot_table(df7 , index= ['Year' , 'Literacy/GDP'] , aggfunc='sum')

In [ ]:
# Pivot table with MEAN aggregation
pd.pivot_table(df7 , index= ['Year' , 'Literacy/GDP'] , aggfunc='mean')

# Hierarchical indexing

In [ ]:
df7

In [ ]:
df8=df7.set_index(['Year', 'Literacy/GDP'])
df8

In [ ]:
df8.index

In [ ]:
df8.loc['2010']

In [ ]:
df8.loc[['2010']]

In [ ]:
df8.loc['2015','Literacy']

In [ ]:
df8.loc['2015','Literacy']

In [ ]:
df8=df7.set_index(['Year', 'Literacy/GDP' , 'Country'])
df8

### SWAP Columns in Hierarchical indexing

In [ ]:
df7

In [ ]:
df8=df7.set_index(['Year', 'Literacy/GDP'])
df8

In [ ]:
# Swaping the columns in Hierarchical index
df9 = df8.swaplevel('Year', 'Literacy/GDP')
df9

In [ ]:
# Swaping the columns in Hierarchical index
df9 = df9.swaplevel('Year', 'Literacy/GDP')
df9

# Crosstab in Pandas

In [ ]:
df7

In [ ]:
pd.crosstab(df7['Literacy/GDP'] , df7.Value , margins=True)

In [ ]:
# 2 way cross table
pd.crosstab(df7.Year , df7['Literacy/GDP'] , margins=True)

In [ ]:
# 3 way cross table
pd.crosstab([df7.Year , df7['Literacy/GDP']] , df7.Country, margins=True)

# Row & Column Bind

### Row Bind

In [ ]:
df8 = pd.DataFrame({'ID' :[1,2,3,4] ,  'Name' :['Asif' , 'Basit' , 'Ross' , 'John'] , 'Score' :[99 , 66 , 44 , 33]})
df8

In [ ]:
df9 = pd.DataFrame({'ID' :[5,6,7,8] ,  'Name' :['Michelle' , 'Ramiro' , 'Vignesh' , 'Damon'] , 'Score' :[78 , 54 , 77 , 87]})
df9

In [ ]:
# Row Bind with concat() function
pd.concat([df8 , df9])

In [ ]:
# Row Bind with append() function
df8.append(df9)

### Column Bind

In [ ]:
df10 = pd.DataFrame({'ID' :[1,2,3,4] , 'Name' :['Asif' , 'Basit' , 'Ross' , 'John']})
df10

In [ ]:
df11 = pd.DataFrame({'Age' :[20,30,35,40] , 'Score' :[99 , 66 , 44 , 33]})
df11

In [ ]:
pd.concat([df10,df11] , axis = 1)